backend/app/controllers/adventures_controller.rb

    def create
        @adventure = Adventure.create(date: params["date"], snippet: params["snippet"], rating: params["rating"], park_id: params["park_id"])
---
INSERT INTO "adventures" ("date", "snippet", "rating", "park_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-03-02"], ["snippet", "sda"], ["rating", 2], ["park_id", 3], ["created_at", "2020-03-08 23:12:33.125433"], ["updated_at", "2020-03-08 23:12:33.125433"]]

    def destroy
        @adventure = Adventure.find(params[:id])
        @adventure.destroy!
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "adventures" WHERE "adventures"."id" = ?  [["id", 1]]