backend/app/controllers/parks_controller.rb

    def index
        @parks = Park.all
---
SELECT "parks".* FROM "parks"

    def show
        @park = Park.find(params[:id])
---
SELECT  "parks".* FROM "parks" WHERE "parks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]